ibrahim_folder/cases/fan_1/0/p
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 object p;
}

dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 0;

boundaryField
{
  inlet
  {
    type zeroGradient;
  }
  outlet
  {
    type fixedValue;
    value uniform 0;
  }
  upperWall
  {
    type zeroGradient;
  }
  lowerWall
  {
    type zeroGradient;
  }
  frontAndBack
  {
    type empty;
  }
  walls
  {
    type zeroGradient;
  }
  pressure_outlet
  {
    type fixedValue;
    value uniform 0.0;
  }
  velocity_inlet
  {
    type zeroGradient;
  }
} 	// ************************************************************************* //

